content/talks.md
+++
title = "Talks"
author = ["Abizer Nasir"]
draft = false
+++

Talks and presentations I've given at various conferences and meet-ups over the years.


## The Road to Damascus, or FRP and Me {#the-road-to-damascus-or-frp-and-me}

_NSSpain 2017-09-14_

A talk given at NSSpain about my experiences of looking into using Functional Reactive Programming with RxSwift.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/the-road-to-damascus-or-frp-and-me)
-   [Video on NSSpain's Vimeo](https://speakerdeck.com/abizern/the-road-to-damascus-or-frp-and-me)

---


## Be Your Own Backend Developer {#be-your-own-backend-developer}

_Code Mobile, Chester, 2017-04-18_

An overview of Serve Side Swift. A video recording was made, but unfortunately it isn't available.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/be-your-own-backend-developer)

---


## Safer Programming with Types {#safer-programming-with-types}

_Swift London, 2016-10-25_

A lightning talk from a Swift London meetup

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/safer-programming-with-types) notes attached
-   [Video on YouTube](https://www.youtube.com/watch?v=uR6ox-9VPAA&t=1s)

---


## Core Data: It's not Dead Yet {#core-data-it-s-not-dead-yet}

_FrenchKit 2016-09-23_

I spoke at the first FrenchKit conference about how Core Data is still relevant.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/core-data-its-not-dead-yet)
-   [Video on YouTube](https://youtu.be/iOdg7WOEWWE)

---


## Being Imperfect in a Perfect World {#being-imperfect-in-a-perfect-world}

_NSBarcelona, 2016-09-21_

I spoke at the NSBarcelona meetup about the choices we make about the patterns we use in development.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/being-imperfect-in-a-perfect-world)

---


## Swift London Pre-WWDC Panel {#swift-london-pre-wwdc-panel}

_Swift London, 2016-06_

I was a late addition to this, which is my excuse for looking so scruffy.

-   [Video on YouTube](https://www.youtube.com/watch?v=PK1PPNTmGuw)

---


## Dependency Management with Carthage {#dependency-management-with-carthage}

_CocoaHeads Stockholm, 2016-05_

An updated of my previous year's talk about using Carthage for dependency management.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/dependency-management-with-carthage)
-   [Video on Vimeo](https://vimeo.com/album/3943556/video/165920026)

---


## Carthage {#carthage}

_NSLondon 2015-07-30_

A talk at NSLondon about using Carthage for dependency management.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/carthage)

---


## What Haskell Teaches me about Writing Swift {#what-haskell-teaches-me-about-writing-swift}

_AltConf, San Francisco, 2015-06_

I had a chance to present a longer version of the lightning talk I gave at Swift Summit. These are my personal thoughts about writing Swift after knowing some Haskell.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/what-haskell-teaches-me-about-writing-swift)
-   A video was made of this, but it's no longer available.

---


## What Haskell Taught me about Swift {#what-haskell-taught-me-about-swift}

_Swift Summit, London, 2015-03-21_

A lightning talk about a few things that knowing Haskell helped me with Swift

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/what-haskell-taught-me-about-writing-swift)

---


## Fizz Buzz in Swift {#fizz-buzz-in-swift}

_NSLodon, 2014-08-14_

A talk I gave about different approaches to solving the Fizz Buzz problem in in Swift, along with some thoughts about the new language.

This was my first mention in [iOS Dev Weekly](https://iosdevweekly.com/issues/167).

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/fizzbuzz-in-swift-a-talk-with-3-codas)

---


## Adding 3rd Party Code to your Project {#adding-3rd-party-code-to-your-project}

_iOSCon 2014, London, 2014-05-15_

Covering the usage of Git and CocoaPods for adding dependencies to an Xcode project.

-   [Slides on Speaker Deck](https://speakerdeck.com/abizern/adding-3rd-party-code-to-xcode-projects)
-   [Video at Skills Matter](https://skillsmatter.com/skillscasts/5058-third-party-code) (free login required)

---


## DVCS at LiDG {#dvcs-at-lidg}

_LiDG, London, 2010-10-08_

A short presentattion to the London iPhone Developer Group in the Regent Street Apple store.